{
    "categories": {
        "communities": {
            "title": "Communities",
            "type": "multi",
            "groups": {
                "rural-villages": {
                    "title": "Rural Villages",
                    "tables": [
                        {
                            "type": "standard",
                            "title": "Rationale for the Village's Existence",
                            "items": [
                                "Once a garrison outpost of a nation",
                                "A mine or quarry, perhaps now exhausted",
                                "A spot where refugees of a calamity settled",
                                "Holy ground or a temple to a particular faith",
                                "A plant or animal grows very well here",
                                "It's a safe waypost on a trade route",
                                "Refuge for a despised minority or group",
                                "A bandit camp that went legitimate",
                                "A self-ruled home for demihuman residents",
                                "It's a safe base for salvage or ruin plundering",
                                "Decayed remnant of an ancient city",
                                "It grew up around a lordly manor or estate"
                            ]
                        },
                        {
                            "type": "standard",
                            "title": "Who Runs It?",
                            "items": [
                                "A hereditary headman",
                                "A reeve picked by a lord",
                                "A temple representative",
                                "A council of elders",
                                "A cruel and feared bully",
                                "A popularly-chosen chief",
                                "A dreaded sorcerer",
                                "A pragmatic warlord",
                                "The richest native there",
                                "A traditional squire",
                                "A patriarch or matriarch",
                                "An organization's envoy"
                            ]
                        },
                        {
                            "type": "standard",
                            "title": "Significant Locals",
                            "items": [
                                "The village harlot",
                                "The worst local bully",
                                "A gifted young peasant",
                                "A half-savage shepherd",
                                "A charismatic priest",
                                "A major landowner",
                                "A youth who wants out",
                                "Venerable old farmer",
                                "Criminal in rural hiding",
                                "Native hedge mage",
                                "A noble's local reeve",
                                "Important artisan"
                            ]
                        },
                        {
                            "type": "standard",
                            "title": "A Current Pressing Problem",
                            "items": [
                                "Vital food stores have been lost or stolen",
                                "Two families are in a long-running feud",
                                "A new religion is making trouble with the old",
                                "The lord's reeve has been given unreasonable quotas",
                                "An upstart newcomer is disrupting the native hierarchy",
                                "A socially marginal family is suspected of crimes",
                                "A dangerous beast or foe is lurking near the place",
                                "A local bully and his friends are causing trouble",
                                "The crops or herds are in very poor condition",
                                "An ambiguous land dispute is getting bloody",
                                "A curse or magical woe is vexing the people",
                                "Noble quarrels have caused collateral damage"
                            ]
                        },
                        {
                            "type": "standard",
                            "title": "Local Likely to Interact with Adventurers",
                            "items": [
                                "An ambitious local who wants to get to the city",
                                "Social outcast who can't ask any local for help",
                                "Gentry who wants no local gossip about their need",
                                "Ex-city dweller eager for contact with the worldly",
                                "Comparatively rich villager with a need",
                                "Starry-eyed young local swooning for adventurers",
                                "Village priest in need of outside help",
                                "Reeve who can't reasonably call on natives for a job",
                                "Village leader who wants expendable help",
                                "Burly local militiaman who watches new faces here",
                                "Shifty native who wants some clueless accomplices",
                                "Clan patriarch who doesn't want to use their own kin"
                            ]
                        },
                        {
                            "type": "standard",
                            "title": "Interesting Things the Place Can Offer Heroes",
                            "items": [
                                "An unusually large amount of saved coinage",
                                "Valuable local specialty product",
                                "Heirloom magic item passed down to the leader",
                                "A magical service unique to a local tradition",
                                "A map or secret leading to a Deep or plunder site",
                                "A temple with potent healing magics available",
                                "A secret treasure acquired generations ago",
                                "Large amounts of produce or local products",
                                "Ownership of an abandoned farm or structure",
                                "Contacts with rural bandits or criminal rings",
                                "Favors from the lord who's very fond of the village",
                                "Young locals willing to take service with the party"
                            ]
                        },
                        {
                            "type": "tag",
                            "select": 2,
                            "title": "Community Tags",
                            "tagRef": "communities"
                        }
                    ]
                },
                "major-cities": {
                    "title": "Major Cities",
                    "tables": [
                        {
                            "title": "Rationale for the City's Existence",
                            "type": "standard",
                            "items": [
                                "It's the former seat of a vanished nation",
                                "It's a trade nexus that has greatly prospered",
                                "It's an industrial or productive center",
                                "There is heavy resource extraction nearby",
                                "It controls a vital defensive point",
                                "It's built around an ancient Working",
                                "It's a stronghold of a local subculture",
                                "It's a sacred city to an important faith",
                                "It's a shared market for many villages",
                                "It's a place of great beauty or healthfulness",
                                "It's a shelter from dangerous environs",
                                "The natives are somehow bound here"
                            ]
                        }
                    ]
                }
            }
        },
        "nations": {
            "title": "Nations",
            "type": "single",
            "tables": [
                {
                    "title": "Disputes With a Neighboring State",
                    "type": "standard",
                    "items": [
                        "Raiders are taking refuge in their lands",
                        "Ownership of a resource site is disputed",
                        "A usurper or criminal is being sheltered there",
                        "A troublemaking religion is based there",
                        "Their rulers have a political claim on the throne",
                        "A diplomatic marriage is going sour",
                        "A past war's savagery has left deep scars",
                        "Their culture is supplanting local beliefs",
                        "Their immigrants are gaining great influence",
                        "They broke off an alliance or important pact",
                        "They lured away an academy or great temple",
                        "Border tariffs and taxes are blocking trade",
                        "They drove a terrible beast into this land",
                        "A Working of theirs caused problems here",
                        "They woke up a great peril from the past",
                        "They're cooperating with an enemy group",
                        "They're suspected of backing assassinations",
                        "A spy ring is suspected or has been found",
                        "They refused to give aid for some current need",
                        "They've been hostile to an allied group"
                    ]
                },
                {
                    "title": "Positive Ties With a Neighboring State",
                    "type": "standard",
                    "items": [
                        "The ruling classes are related in some way",
                        "An important faith crosses the border",
                        "They fought by our side sometime in the past",
                        "Their culture is widely admired here",
                        "They helped to overcome an eldritch peril",
                        "They held back an enemy from our border",
                        "They are co-ethnics of the same origins",
                        "They provide critical trade relations",
                        "Sages and scholars came from there",
                        "They gave critical aid during a disaster",
                        "A hero of this land came originally from there",
                        "A past hero-king once ruled both lands",
                        "They produce some vital commodity",
                        "They have a shared enemy",
                        "A Working they have is helpful here, too",
                        "A long-standing alliance or trade pact exists",
                        "They recently conceded some disputed land",
                        "They greatly admire elements of this culture",
                        "They're considered unusually attractive here",
                        "They took in refugees from here at one point"
                    ]
                },
                {
                    "title": "Current National Problems",
                    "type": "standard",
                    "items": [
                        "Farmland is becoming worn-out and depleted",
                        "Verminous monsters are swarming",
                        "A rebel front is stirring up trouble",
                        "An outside power is backing internal strife",
                        "The leadership is inept and distracted",
                        "A religious reformer is breaking old compacts",
                        "An evil is provoking outraged rioting",
                        "Dark cults are attracting the ambitious",
                        "A Blighted horde is threatening the borders",
                        "An ancient ruin has disgorged some peril",
                        "Malcontents have obtained a potent artifact",
                        "Luxuriance has left the nation's coffers bare",
                        "Local aristocrats are pushing for independence",
                        "An important mine has run out or been harmed",
                        "A sinister favorite has infatuated the leader",
                        "A recurring plant plague is causing hunger",
                        "Fearsome monsters are migrating into the land",
                        "A rival is preparing for war or raiding",
                        "A grand national plan is exhausting the people",
                        "A savage grudge has erupted between lords"
                    ]
                },
                {
                    "title": "Good Things Happening Right Now",
                    "type": "standard",
                    "items": [
                        "A splendid mine or resource has been found",
                        "A pious saint is strengthening a major faith",
                        "A noble heir shows signs of heroic greatness",
                        "A major rival has recently suffered a calamity",
                        "New farmland has been opened up recently",
                        "A new trade route has been forged",
                        "A horrible monster was slain or driven off",
                        "Good harvests have enriched the people",
                        "A wicked minister has been deposed",
                        "A new academy has recently opened",
                        "A bandit or rebel uprising has been crushed",
                        "Two rival lords have started to make peace",
                        "An old enemy has agreed to a peace pact",
                        "The military won a recent smashing victory",
                        "A helpful Working has been activated",
                        "A powerful artifact is helping the ruler",
                        "An old source of unrest has been calmed",
                        "A dark cult has been revealed and purged",
                        "New diplomatic ties have been made",
                        "A new lord has risen, loved by his people"
                    ]
                },
                {
                    "title": "Positive Nation Themes",
                    "type": "standard",
                    "items": [
                        {
                            "title": "Enlightenment",
                            "tag": "where knowledge is loved",
                            "description": "A genuine love of knowledge imbues the nation, such that academies and schools have an important role in social and political life and a good education is considered a hallmark of gentility. The populace has a genuine curiosity and zest for investigation, and finding the truth of things is considered more important than secure stability."
                        },
                        {
                            "title": "Expansion",
                            "tag": "where things swell greater",
                            "description": "The nation's borders are expanding, either through successful conquest, peaceful assimilation of bordermarches, or the seductive appeal of their values and culture. The society is vigorous and confident, assured of the justification of their expansion and of the good it will provide to everyone deserving of good. There's usually some truth to this, albeit perhaps less than the expansionists would like to admit."
                        },
                        {
                            "title": "Hope",
                            "tag": "that the future should be better",
                            "description": "The nation is imbued with a sense of hope and potential, the promise of a better day to come and a brighter future for those who win through their present problems. There may have been a recent discovery of some great trove of resources, some magical or technological innovation that promises great results, or the rise of a beloved house of seemingly- blessed rulers."
                        },
                        {
                            "title": "Justice",
                            "tag": "where a reckoning is had",
                            "description": "One or more powers or institutions in the nation have a genuine concern for justice and righteousness, such that the society's laws and values are fairly and even-handedly enforced. These laws may not perfectly match modern conceptions of justice, but what exists is meant to be applied evenly. Righteous crusaders for the cause, honest magistrates, and some great struggle to enforce justice on a widely- understood wrong might all be present."
                        },
                        {
                            "title": "Legitimacy",
                            "tag": "where rulers are by right",
                            "description": "The nation's rulers or controlling institutions have a profound degree of legitimacy among the populace, such that it's hard to imagine ever overthrowing them as a group. Individuals among them might be criminals or incompetents, but the structures as a whole are accepted as necessary and eternal by most elements of the society. This legitimacy may derive from divine mandates, personal prowess, honored lineages, or a terror of the chaos that would exist without them."
                        },
                        {
                            "title": "Pageantry",
                            "tag": "of splendor and magnificence",
                            "description": "The nation is marked by dramatic displays, magnificent architecture, sweeping demonstrations of might, and large-scale undertakings for the glory or edification of the rulers and populace. The locals tend to place great store by such ritual displays, finding them inspiring, meaningful, and important in more than strictly material ways. These grandiose efforts actually have real results towards unification, inspiration, and societal harmony."
                        },
                        {
                            "title": "Prosperity",
                            "tag": "with wealth easily had",
                            "description": "The nation is relatively rich, such that conventional scourges of famine, privation, and desperation aren't nearly as common as they would be in other cultures. Pockets of genuine want may exist, but the average commoner leads a well-fed, wellclothed life and the grandees have the resources for impressive displays of wealth. This prosperity may be the fruit of unusual natural resources, exceptional societal harmony, magical blessings, or simple good climate."
                        },
                        {
                            "title": "Renewal",
                            "tag": "with things growing brighter",
                            "description": "A spirit of reformation and renewal breathes through the nation, with old noble houses rising once again, decayed religions being reformed, corrupt institutions being shaken, and the populace generally more insistent on improvement. This renewal could be a harkening back to the old ideals of yore or an appeal to some new innovation, and the subjects could just as easily be a royal house recalled from exile as a new republic's establishment."
                        },
                        {
                            "title": "Triumph",
                            "tag": "with victory a fresh memory",
                            "description": "Something wonderful has recently been accomplished in the nation; a dark lord defeated, an evil king overthrown, a plague ended, a natural disaster overcome, or the like. The setting is touched with a sense of success and victory, despite the costs of that triumph, and filled with a confidence in its own power and potential. There will be many new institutions and groups seeking to exploit the aftermath and earn their rightful share of the rewards."
                        },
                        {
                            "title": "Unity",
                            "tag": "where purposes are shared",
                            "description": "Powers and groups within the nation are highly united in their goals and sense of fellow-feeling. While not necessarily xenophobic, they will tend to value their brethren more than strangers, and paper over internal conflicts and disagreements that might fester into civil disorder or chaos in less harmonious societies. These societies might have been shaped by some all-consuming peril that forced them together or a culture that greatly prizes unity."
                        }
                    ]
                },
                {
                    "title": "Negative Nation Themes",
                    "type": "standard",
                    "items": [
                        {
                            "title": "Barbarism",
                            "tag": "with brutal savagery",
                            "description": "The nation is brutally assailed by bestial, primitive forces, whether from external enemies or internal divisions. Naked violence, cruelty, ignorance, and hatred are always near the surface of things, either as threats pressing on the familiar or as instincts and habits among the natives."
                        },
                        {
                            "title": "Decadence",
                            "tag": "of sins and fadings",
                            "description": "The nation is voluptuously cruel, indulgent, and indifferent to the prices it pays for its pleasures. Unspeakable debaucheries and sordid delights are in common circulation, and few ever think to question the appropriateness of inflicting brutal evils in order to obtain some elevated enjoyment or refined pleasure. The PCs are regularly exposed to the consequences of such indulgences and the damage they inflict on others."
                        },
                        {
                            "title": "Despair",
                            "tag": "with good things unlooked-for",
                            "description": "The nation is redolent of hopelessness and apathetic submission to fate. It may be because some overwhelming evil seems inevitably due to pass, or because all prior efforts at improvement have brought only worse suffering, or because some bright cultural hope or golden age is now clearly lost and ruined forever. The nation will tend to accept evils and sufferings as inevitable, and the natives will do little to rebel, resist, or defy their unhappy fates."
                        },
                        {
                            "title": "Exhaustion",
                            "tag": "with strength spent and lost",
                            "description": "The nation is depleted of something critical, whether that is a tangible resource or their spiritual reserves of enthusiasm and hope. Everything is tired in this nation, with spent rivers, barren fields, cut-over forests, and shorn hillsides. If material resources are sufficient, the natives simply don't have the energy or enthusiasm to bring in more than they presently do, perhaps out of a sense that nothing good can come of any putative improvement."
                        },
                        {
                            "title": "Ignorance",
                            "tag": "of terrors and the unknown",
                            "description": "The nation is an ignorant one, redolent of (incorrect) superstition, false gods, blundering institutions, and erroneous beliefs of all kinds. These beliefs are somehow critical to the setting's culture or society, such that being rid of them would cause some profound, potentially bloody disruption of life. Life in this nation can go on as it does only so long as the ignorance remains unilluminated, and the vast majority of its populace would rather remain in error than exist in chaos."
                        },
                        {
                            "title": "Oppression",
                            "tag": "with rule a crushing weight",
                            "description": "Some substantial portion of the nation is cruelly oppressed by some force. It's rare that this is the same group in all areas of the nation; oppression as a key theme to the setting implies that many groups in many places suffer under this, and it may be accepted as a commonplace that one group or another needs to be harshly repressed if the rest of society is to prosper. Oppressive groups will usually have a clearly-enunciated philosophy of why this state of affairs is necessary, and it usually will have at least some coloring of justification to have persisted as it has."
                        },
                        {
                            "title": "Poverty",
                            "tag": "where even the rich are poor",
                            "description": "The nation is poor. Even aristocrats might not be assured of the necessary staples of life, or basic resources might be constantly threatened by monsters, warfare, calamities, or simple dearth. The struggle for resources and the basic necessities for survival are apt to drive numerous conflicts in the setting, and the consequences of failure can be far worse than mere discomfort for the losers."
                        },
                        {
                            "title": "Precarity",
                            "tag": "with all goods made fleeting",
                            "description": "Whatever good the nation has is under immediate siege by circumstances, and it looks very likely that it might crumble. Something is happening in the setting to make old verities and assured societal institutions totter, whether a massive monstrous invasion or a revolt by some displeased underclass. These institutions will tend to strike out violently at threats, fearing that their basic existence is at stake, and the recklessness of their responses might be the very catalyst that provokes their eventual collapse."
                        },
                        {
                            "title": "Stratification",
                            "tag": "where classes do not touch",
                            "description": "The nation draws harsh lines between social classes, cultural groups, regions, sexes, or some other distinction between people. Castes and aristocracies are a common feature of these settings, ones drawn sharply by blood or birth circumstances. Adventurers are apt to be wild cards in these societies due to their ability to obtain outsized personal power, and they may regularly run into conflicts or complications that they have the strength to deal with, but not the social permission."
                        },
                        {
                            "title": "Violence",
                            "tag": "where life is something cheap",
                            "description": "The nation is a bloody one, with human life held cheap and death a commonplace. This may be the result of incessant warfare, such that most people half-expect to die in battle, or it may be the product of a society that simply doesn't value people's lives. Death may be a penalty for comparatively trivial sins, or the environment might just be so dangerous that a death in bed is a thing unlooked-for by most."
                        }
                    ]
                }
            ]
        },
        "society": {
            "title": "Society",
            "type": "multi",
            "groups": {
                "physical-appearance": {
                    "title": "Physical Appearance",
                    "tables": [
                        {
                            "title": "Typical Skin Colors in the Populace",
                            "type": "standard",
                            "items": [
                                "Extremely dark hues",
                                "Dark browns and mocha shades",
                                "Golden, sallow, or ivory",
                                "Olives or light browns",
                                "Ruddy or tanned complexions",
                                "Pale white or pinkish hues",
                                "An unusual color or pattern of colors",
                                "Scales, fur, or unusual hide type"
                            ]
                        },
                        {
                            "title": "Hair Color",
                            "type": "standard",
                            "items": [
                                "Night-black",
                                "Dark browns",
                                "Lighter browns",
                                "Red shades",
                                "Blonds",
                                "White or white-blond",
                                "An unusual palette",
                                "They lack hair"
                            ]
                        },
                        {
                            "title": "Hair Texture",
                            "type": "standard",
                            "items": [
                                "Very tightly-curled",
                                "Dense and curled",
                                "Slightly wavy",
                                "Stiff and straight",
                                "Thick and wavy",
                                "Thin and fine",
                                "Thick and flowing",
                                "Scant and delicate"
                            ]
                        },
                        {
                            "title": "Eye Coloration",
                            "type": "standard",
                            "items": [
                                "Black or extremely dark brown",
                                "Hazel or olive",
                                "Blues in varying shades",
                                "Grays, whether flat or metallic",
                                "Ambers and yellows",
                                "Greens in different shades",
                                "An unusual or luminous color",
                                {
                                    "type": "rollAgain",
                                    "text": "Slit or unusual pupils; "
                                }
                            ]
                        },
                        {
                            "title": "Optional Common Forms of Adornment",
                            "type": "standard",
                            "items": [
                                "Intricate hair styles or braiding",
                                "Painted skin markings that sometimes change",
                                "Tattoos of some cultural significance",
                                "Piercings, whether minor or elaborate",
                                "Role or class-specific clothing items",
                                "Patterned hair shaving or depilation",
                                "Culturally-significant jewelry or accessories",
                                "Color choices with social meaning to them",
                                "Socially-meaningful animal motif items",
                                "Worn weapons, tools or trade implements",
                                "Significant scent or perfume uses",
                                "Impractical or elaborate role-based clothes"
                            ]
                        },
                        {
                            "title": "Optional Physical Quirks or Traits",
                            "type": "standard",
                            "items": [
                              "They possess an extra eye somewhere",
                              "An additional set of limbs or extremities",
                              "Extremely pronounced sexual dimorphism",
                              "Patches of feathers, scales, fur, or the like",
                              "They have a tail of some sort",
                              "They possess wings, whether useful or not",
                              "Their skin is an unusual texture",
                              "Sigil-marked by their creator in some way",
                              "The sexes look very similar to outsiders",
                              "They have a particular scent to them",
                              "Their voices are peculiar in some way",
                              "Additional or too few fingers or toes",
                              "They have animalistic features in some way",
                              "Have one or more manipulatory tentacles",
                              "They have light-emitting organs or skin",
                              "Their mouths are fanged or tusked",
                              "They have alien Outsider features somehow",
                              "Their proportions are distinctly strange",
                              "They don't show age the way others do",
                              {
                                "type": "rollAgainAndBlend",
                                "text": "Roll twice and blend the results",
                                "amount": 2
                              }
                            ]
                          }
                    ]
                }
            }
        }
    }
}